app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    if params[:level].present?
      @events = Event.where(level: params[:level])
      @events = @events.by_exhibitor(params[:exhibitor]) if params[:exhibitor].present?